{
    "section": {
        "profile": {
            "sectionId": "profile",
            "Component": "Profile",
            "navbar": false,
            "props": {
                "greeting": "Hey there! I'm",
                "name": "Thomas Gascoyne",
                "subtitle": "Graduate Software Engineer",
                "description": "I specialise in creating exceptional software experiences, from the inside out.",
                "socialIcons": [
                    {
                        "url": "https://www.linkedin.com/in/thomas-gascoyne",
                        "icon": "linkedin-in-brands-solid"
                    },
                    {
                        "url": "https://github.com/TGasco",
                        "icon": "github-brands-solid"
                    },
                    {
                        "url": "mailto:email@thomasgascoyne.com",
                        "icon": "envelope-solid"
                    }
                ]
            }
        },
        "about": {
            "sectionId": "about",
            "title": "About Me",
            "Component": "About",
            "navbar": true,
            "props": {
                "content": [[{"text": "Hi I'm Thomas Gascoyne, a Graduate Computer Scientist from the "}, {"text": "University of Liverpool", "style": "highlight", "link": "https://www.liverpool.ac.uk"}, {"text": ". I have a deep passion for full-stack software development and I am always looking to learn new skills and technologies."}],
                            [{"text": "As a curious and creative individual, I have always had a fascination for understanding how things work. My introduction to programming through Scratch at an early age allowed me to create anything I could concieve. From games, calculators, to a virtual lemonade stand, my imagination ran wild with ideas - and I was hooked."}],
                            [{"text": "Fast forward to today, I have recently graduated with a First Class Honours in Computer Science; I've built, updated and maintained core internal tools for a "}, {"text": "Games Development company", "style": "highlight", "link": "https://www.feralinteractive.com/"}, {"text": " and I continue to work on interesting projects to expand my skillset and knowledge."}],
                            [{"text": "When I'm not at the computer, I enjoy hiking in the great outdoors and exploring new places with friends or alone. I'm also a keen chess player (albeit not the best)."}]
                            ],
                "image": "profilePic",
                "url": "https://thomasgascoyne.com"
            }
        },
        "experience": {
            "sectionId": "experience",
            "title": "Where I've Been",
            "Component": "Experience",
            "navbar": true,
            "props": [
                {
                    "title": "Development QA Engineer",
                    "company": "Feral Interactive",
                    "link": "https://www.feralinteractive.com/",
                    "duration": {
                        "start": "2021-07-01",
                        "end": "2022-07-31"
                    },
                    "description": ["Developed and maintained automated build and testing frameworks inside the CI/CD pipeline for games on macOS, Linux, iOS and Android.",
                    "Worked closely with the QA and development teams to develop plugins for the Atlassian suite to improve the efficiency of the QA team.",
                    "Aided in automating performance and stress testing of software across different hardware configurations to implement default settings - striking a balance between performance and visual quality.",
                    "Performed Quality Assurance testing on games and tools to ensure software quality and stability across the range of supported platforms and hardware."],
                    "technologies": ["Python", "React", "Node.js", "Perl", "CI/CD", "Atlassian", "SVN"]
                },
                {
                    "title": "BSc Computer Science",
                    "company": "University of Liverpool",
                    "link": "https://www.liverpool.ac.uk",
                    "duration": {
                        "start": "2019-09-01",
                        "end": "2023-07-30"
                    },
                    "description": ["Studied a bredth of topics, from foundational to frontier concepts, including: Data Structures & Algorithms, Big Data Analytics, Machine Learning, App Development and High Performance Computing.",
                                    "Worked collaboratively with peers on a variety of projects - utilising version control systems and agile methodologies to deliver high quality production ready software."],
                    "technologies": ["Python", "JavaScript", "Java", "C", "C++", "C#", "SQL", "HTML", "CSS", "Node.js", "Git"]
                }
            ]
        },
        "projects": {
            "sectionId": "projects",
            "title": "Things I've Built",
            "Component": "Project",
            "navbar": true,
            "props": [
                {
                    "title": "Chess Engine in C",
                    "description": "An implementation of Chess in C, using SDL for rendering the board and pieces. Play against a friend or against the computer. Computer AI uses a simple minimax algorithm with alpha-beta pruning to make decisions. Features include move validation, checkmate detection, and castling",
                    "technologies": ["C", "SDL Renderer"],
                    "image": "chess-in-c",
                    "source": "https://github.com/TGasco/ChessInC",
                    "featured": true
                },
                {
                    "title": "Self Hosted Cloud",
                    "description": "A privacy-oriented cloud storage system, designed for intuitive and secure management of personal data. Upload and access your files from anywhere, with the peace of mind that your data is encrypted, secure and private. Preview images and documents directly from the browser.",
                    "technologies": ["Node.js", "JavaScript", "HTML", "CSS"],
                    "image": "self-hosted-cloud",
                    "source": "https://github.com/TGasco/SelfHostedCloud",
                    "featured": true
                }
            ]
        },
        "contact": {
            "sectionId": "contact",
            "Component": "Contact",
            "navbar": true,
            "props": {
                "title": "Get in Touch",
                "content": "Intrigued? Want to work together? I'm always open to new opportunities and challenges. Feel free to drop me a message, and I'll get back to you as soon as I can!",
                "email": "email@thomasgascoyne.com"
            }
        },
        "footer": {
            "sectionId": "footer",
            "Component": "Footer",
            "navbar": false,
            "props": {
                "text": "Designed and built by Thomas Gascoyne",
                "license": "MIT License",
                "sourceUrl": "https://github.com/TGasco"
            }
        }
    }
}
